{
  "architectures": [
    "ASTForAudioClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "dtype": "float32",
  "frequency_stride": 10,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "bad_ignition",
    "1": "cv joint",
    "2": "fuel pump",
    "3": "amortiseur",
    "4": "serpentine belt",
    "5": "tie road",
    "6": "worn_out_brakes"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "amortiseur": 3,
    "bad_ignition": 0,
    "cv joint": 1,
    "fuel pump": 2,
    "serpentine belt": 4,
    "tie road": 5,
    "worn_out_brakes": 6
  },
  "layer_norm_eps": 1e-12,
  "max_length": 1024,
  "model_type": "audio-spectrogram-transformer",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "num_mel_bins": 128,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "time_stride": 10,
  "transformers_version": "4.57.6"
}
